# Pandas

Copyright 2023 Marco A. Lopez-Sanchez.  
Content under [Creative Commons Attribution license CC-BY 4.0](https://creativecommons.org/licenses/by/4.0/).

> **Goal**:  
> Learn the basics of Pandas and give an overview of the library.
>
> **What it is?**  
>A library for dealing with tabular data structures in Python. 
>
> **What it is used for?**  
>This is Python's default library for manipulating tabular-like data. Pandas adds two data structures to Python called Series and DataFrames, as well as all the expected functionality for dealing with tabular data structures. Here we will focus on DataFrames, a 2D tabular data structure with labelled axes (rows and columns) in which columns are of potentially different types. If you normally process your data using Excel-like applications, chances are that this will be your daily buddy in Python.
>
> **Resources**  
> https://pandas.pydata.org/ (official website)  
> https://pandas.pydata.org/docs/ (official documentation)  
> [Python for Data Analysis](https://wesmckinney.com/book/preliminaries.html#navigating_book): A nice book focus on Pandas from the main author of Pandas Wes McKinney

In [1]:
# importing pandas following the standard
import pandas as pd

# Pandas Dataframes: what are they and how to create them?

A Pandas DataFrame is a two-dimensonal data structure with rows (data observations) and labelled columns (variables). It is a mutable (i.e. modifiable) and potentially heterogeneous object so that each column can have similar or different data types (integers, floats, strings, etc) being the number of rows per column equal.

In [2]:
# create a dataframe from a Python dict
# (example taken from https://wesmckinney.com/book/pandas-basics.html)
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

# create the DataFrame
df = pd.DataFrame(data)

# show the data in the notebook
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In the example above, the dictionary keys become the column labels and the lists associated with each key, the rows of the DataFrame. The numbers on the left (unnamed) column indicate the index of each row starting at zero.

## Importing tabular data from files

Although the way of creating DataFrames from Python dictionaries is useful for learning or showing examples, DataFrames are rarely created in this way in real situations. Most of the time you will have to work with data in tabular format that will be hosted on your hard disk or a server. Pandas provides many methods to handle almost any imaginable tabular file format into a DataFrame as well as methods to save this type of data in the desired format. The two most used functions are ``read_csv()`` and ``read_excel()``. The ``read_csv()`` method is used to read CSV or other text-based tabular files, while ``read_excel()`` is used to read Excel files. Both functions return a DataFrame object that can be used to manipulate and analyze data.

In [3]:
dataset = pd.read_csv('data/bulk_composition.csv', delimiter=';')
dataset

,Unnamed: 0,primitive mantle,mean lower crust,CO_eclogite,CO_granulite,CO_pyroxenite,Unnamed: 6
0,SiO2,44.91,53.40,48.44,48.41,50.94,NaN
1,TiO2,0.16,0.82,1.06,1.19,0.11,NaN
2,Al2O3,4.44,16.90,15.54,16.95,3.24,NaN
3,Fe2O3t,8.05,8.57,11.06,13.93,6.12,NaN
4,MnO,0.13,0.10,0.18,0.25,0.14,NaN
5,MgO,37.81,7.24,8.84,5.44,21.84,NaN
6,CaO,3.54,9.59,12.31,10.43,14.87,NaN
7,Na2O,0.36,2.65,1.89,1.66,0.33,NaN
8,K2O,0.03,0.61,0.12,0.62,0.05,NaN
9,P2O5,0.02,0.10,0.12,0.44,0.01,NaN
10,LOI,NaN,NaN,0.66,0.62,1.59,NaN

The ``read_csv()`` function is highly customisable and allows you to modify the behaviour of the function to suit your needs. At a minimum, you have to specify the file path as a Python string, which can point to a local file or a URL address. Another typical parameter is to set the delimiter type of the file to import. By default, the ``read_csv()`` function assumes a comma, a typical separator for CSV files (meaning comma-separated values). In the example above the separator used in the file "bulk_composition.csv" is not a comma but a semicolon and the delimiter is specified inside the function as ``delimiter`` (you can also use the alias ``sep``). If you import a .txt or a .tab (tab-separated) file you will need to specify ``'\t'`` as the delimiter and so on. Another example would be the ``skiprows`` parameter which allows you to define the number of lines to skip as often text/CSV files contain information in the first few lines that are not the actual tabular data, etc. The ``read_csv()`` function has 50 possible parameters at the time this is written, which gives an idea of the control one can exercise when reading tabular data files. You can read the details of each of them in the following link https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html

> ðŸ‘‰ Pandas also allows you to read data copied into your clipboard using the method ``read_clipboard()``.

Pandas can read other tabular file formats including:

- Excel (xls, xlsx, xlsm, xlsb, odf, ods, and odt)
- JSON
- SQL 
- HTML
- HDF5
- XML
- Parquet
- Msgpack
- Stata
- SAS
- SPSS
- Pickle

All Pandas reading methods start with the word ``read`` followed by an underscore and the file type, e.g. ``read_excel()`` or ``read_hdf()`` and so on. On the other hand, if you need to save a DataFrame in any of these formats we follow a similar logic using the word ``to``. For example, ``dataset.to_excel("filename.xlsx")`` or ``dataset.to_csv("filename.csv")``. You can read more on this at https://pandas.pydata.org/docs/user_guide/io.html

> ðŸ‘‰ By default, the ``.to_csv()`` method creates an unlabelled column with the indexes in the first column. To avoid this use the ``index=False`` parameter.

# Inspecting your DataFrame

In [4]:
# head() and tail() methods show the first and last rows respectively (by default five)
dataset.head()

,Unnamed: 0,primitive mantle,mean lower crust,CO_eclogite,CO_granulite,CO_pyroxenite,Unnamed: 6
0,SiO2,44.91,53.40,48.44,48.41,50.94,NaN
1,TiO2,0.16,0.82,1.06,1.19,0.11,NaN
2,Al2O3,4.44,16.90,15.54,16.95,3.24,NaN
3,Fe2O3t,8.05,8.57,11.06,13.93,6.12,NaN
4,MnO,0.13,0.10,0.18,0.25,0.14,NaN

In [5]:
# check all the data types in a dataframe (alternative: dataset.dtypes)
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        11 non-null     object
 1   primitive mantle  10 non-null     float64
 2   mean lower crust  10 non-null     float64
 3   CO_eclogite       11 non-null     float64
 4   CO_granulite      11 non-null     float64
 5   CO_pyroxenite     11 non-null     float64
 6   Unnamed: 6        0 non-null      float64
dtypes: float64(6), object(1)
memory usage: 744.0+ bytes

---

You can access single columns by indexing using square brackets or using dot notation.

In [6]:
# using squared brackets
dataset['CO_eclogite']

0     48.44
1      1.06
2     15.54
3     11.06
4      0.18
5      8.84
6     12.31
7      1.89
8      0.12
9      0.12
10     0.66
Name: CO_eclogite, dtype: float64

In [7]:
# using dot notation
dataset.CO_eclogite

0     48.44
1      1.06
2     15.54
3     11.06
4      0.18
5      8.84
6     12.31
7      1.89
8      0.12
9      0.12
10     0.66
Name: CO_eclogite, dtype: float64

> ðŸ‘‰ Do **not** use column labels with spaces. If column labels have spaces, you will be unable to use dot notation. If you want to use more than one word in column labels, use underscores between words.

In [8]:
# accesing multiple columns (note the double square brackets as we are passing a list of labels)
dataset[['CO_eclogite', 'CO_granulite', 'CO_pyroxenite']]

    CO_eclogite  CO_granulite  CO_pyroxenite
0         48.44         48.41          50.94
1          1.06          1.19           0.11
2         15.54         16.95           3.24
3         11.06         13.93           6.12
4          0.18          0.25           0.14
5          8.84          5.44          21.84
6         12.31         10.43          14.87
7          1.89          1.66           0.33
8          0.12          0.62           0.05
9          0.12          0.44           0.01
10         0.66          0.62           1.59

## Rename column labels

The preferred way is to use the rename method that uses a Python dictionary as follows:

In [9]:
dataset = dataset.rename(columns={'Unnamed: 0':'Oxides', 
                                  'primitive mantle':'primitive_mantle',
                                  'mean lower crust':'mean_lower_crust'})

dataset.head(1)

,Oxides,primitive_mantle,mean_lower_crust,CO_eclogite,CO_granulite,CO_pyroxenite,Unnamed: 6
0,SiO2,44.91,53.4,48.44,48.41,50.94,NaN

# Selecting rows and columns

Above we have already seen a way of accessing one or more columns in a DataFrame using column names. Here we will look at slightly more sophisticated examples of how to access different columns or rows (i.e. subsetting your DataFrame), and how to modify or combine two or more columns.

## By attribute

Pandas allows to select columns by type as follows

In [10]:
dataset.select_dtypes("float64").head()

,primitive_mantle,mean_lower_crust,CO_eclogite,CO_granulite,CO_pyroxenite,Unnamed: 6
0,44.91,53.40,48.44,48.41,50.94,NaN
1,0.16,0.82,1.06,1.19,0.11,NaN
2,4.44,16.90,15.54,16.95,3.24,NaN
3,8.05,8.57,11.06,13.93,6.12,NaN
4,0.13,0.10,0.18,0.25,0.14,NaN

## Using ``.iloc()`` and ``.loc()`` methods

So far we have only used methods to select specific columns, not specific rows or combinations of rows and columns, this is what the ``.iloc`` and ``.loc`` methods allow us to do. They differ in how they refer to the rows and columns:

- ``.loc`` is label-based and uses row and column **labels** to slice the data.
- ``.iloc`` is integer-based (_i_ comes from integer) and uses integer **indexes** to slice the data

<img src="https://raw.githubusercontent.com/marcoalopez/Python_course/main/notebooks/imgs/iloc_vs_loc.jpg" style="zoom:30%;" />

TODO



> ðŸ‘‰ When subsetting a DataFrame it is good practice to use the ``.copy()`` method because what you get by default is a view of the original DataFrame and all modifications you make to this new DataFrame will affect the original one. This is:  
>```python
>new_df = df.loc[['CO_eclogite', 'CO_granulite', 'CO_pyroxenite']] âŒ  
>new_df = df.loc[['CO_eclogite', 'CO_granulite', 'CO_pyroxenite']].copy() âœ…  
>```

# Handling missing values

When loading a dataframe from a CSV file or similar, an empty value in a numeric column will become NaN or ``np.nan``, which means "not a number" (some synonyms are ``null``, ``None``, ``nan`` or ``<NA>``). Pandas has several methods for dealing with missing values. Here, we will show examples of the following methods (the names are quite explicit):

``.info()``: provide a concise summary of a DataFrame including missing values   
``.isna()``: detect missing values returning a boolean mask, ie. empty values get mapped as True.  
``.notna()``: detect not missing values returning a boolean mask, ie. not empty values get mapped as True.  
``.fillna()``: fill NA/NaN values using different method (e.g. using interpolation or a especific value)  
``.dropna()``: remove missing values based on certain conditions.

In [11]:
# check if there are values with missing values in your dataset
dataset['primitive_mantle'].isna()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
Name: primitive_mantle, dtype: bool

In [12]:
# drop all columns with nan values
dataset.dropna(axis='columns')

    Oxides  CO_eclogite  CO_granulite  CO_pyroxenite
0     SiO2        48.44         48.41          50.94
1     TiO2         1.06          1.19           0.11
2    Al2O3        15.54         16.95           3.24
3   Fe2O3t        11.06         13.93           6.12
4      MnO         0.18          0.25           0.14
5      MgO         8.84          5.44          21.84
6      CaO        12.31         10.43          14.87
7     Na2O         1.89          1.66           0.33
8      K2O         0.12          0.62           0.05
9     P2O5         0.12          0.44           0.01
10     LOI         0.66          0.62           1.59

> ðŸ‘‰ **Axis in DataFrames**.  
> Contrary to NumPy arrays, that can have as many axes as you need, DataFrames only has two axes: axis 0 to refer to rows, and axis 1 to refer to columns. Pandas allows the user to use regular names instead of integers to refer to them. Axis 0 has two aliases ``'index'`` and ``'rows'`` and axis 1 ``'columns'``. For example if we want to remove all columns with NaN values using the ``.drop`` method we will do ``df.dropna(axis='columns')``, while if we want to do the same but for rows ``df.dropna(axis='rows')``. Series only have one axis.

In [13]:
# drop only the columns that are all nans, for rows will be: .dropna(axis='rows', how='all')
dataset.dropna(axis='columns', how='all')

,Oxides,primitive_mantle,mean_lower_crust,CO_eclogite,CO_granulite,CO_pyroxenite
0,SiO2,44.91,53.40,48.44,48.41,50.94
1,TiO2,0.16,0.82,1.06,1.19,0.11
2,Al2O3,4.44,16.90,15.54,16.95,3.24
3,Fe2O3t,8.05,8.57,11.06,13.93,6.12
4,MnO,0.13,0.10,0.18,0.25,0.14
5,MgO,37.81,7.24,8.84,5.44,21.84
6,CaO,3.54,9.59,12.31,10.43,14.87
7,Na2O,0.36,2.65,1.89,1.66,0.33
8,K2O,0.03,0.61,0.12,0.62,0.05
9,P2O5,0.02,0.10,0.12,0.44,0.01
10,LOI,NaN,NaN,0.66,0.62,1.59

In [14]:
# fill null values with an specific value
dataset.fillna(0.0)

,Oxides,primitive_mantle,mean_lower_crust,CO_eclogite,CO_granulite,CO_pyroxenite,Unnamed: 6
0,SiO2,44.91,53.40,48.44,48.41,50.94,0.0
1,TiO2,0.16,0.82,1.06,1.19,0.11,0.0
2,Al2O3,4.44,16.90,15.54,16.95,3.24,0.0
3,Fe2O3t,8.05,8.57,11.06,13.93,6.12,0.0
4,MnO,0.13,0.10,0.18,0.25,0.14,0.0
5,MgO,37.81,7.24,8.84,5.44,21.84,0.0
6,CaO,3.54,9.59,12.31,10.43,14.87,0.0
7,Na2O,0.36,2.65,1.89,1.66,0.33,0.0
8,K2O,0.03,0.61,0.12,0.62,0.05,0.0
9,P2O5,0.02,0.10,0.12,0.44,0.01,0.0
10,LOI,0.00,0.00,0.66,0.62,1.59,0.0

> ðŸš¨ If we apply any Pandas method to a DataFrame, as we do in these examples, what we are getting are the output of the method without modifying the original DataFrame. If we really want to modify the DataFrame we must do it explicitly as follows:
>
> ```python
> dataset = dataset.fillna(0.0)  âœ… Recommended way
> ```
> an alternative way, which you will see in many older (or not so old) tutorials, is to pass the ``inplace`` parameter as True inside the method (see below). This is currently **not recommended**, the ``inplace`` parameter remains for legacy reasons, but it is possible that it will disappear in future versions of Pandas.
>
> ```python
> dataset.fillna(0.0, inplace=True)  âŒ Not recommended
> ```

In [15]:
# just a view
dataset.head(2)

,Oxides,primitive_mantle,mean_lower_crust,CO_eclogite,CO_granulite,CO_pyroxenite,Unnamed: 6
0,SiO2,44.91,53.40,48.44,48.41,50.94,NaN
1,TiO2,0.16,0.82,1.06,1.19,0.11,NaN

In [16]:
# you actually modified the DataFrame
dataset = dataset.dropna(axis='columns', how='all')
dataset.head(2)

,Oxides,primitive_mantle,mean_lower_crust,CO_eclogite,CO_granulite,CO_pyroxenite
0,SiO2,44.91,53.40,48.44,48.41,50.94
1,TiO2,0.16,0.82,1.06,1.19,0.11

# Extending a DataFrame

## Adding columns

TODO

> ðŸ‘‰ Avoid iterating over rows. Use vectorized operations when possible or the ``.apply()`` method

## Adding rows

TODO

## Operations

TODO

| Operators | Pandas method   |                 |                |
| --------- | --------------- | --------------- | -------------- |
| \+        | ``.add()``      |                 |                |
| \-        | ``.sub()``      | ``.subtract()`` |                |
| \*        | ``.mul()``      | ``.multiply()`` |                |
| /         | ``.div()``      | ``.divide()``   | ``.truediv()`` |
| //        | ``.floordiv()`` |                 |                |
| %         | ``.mod()``      |                 |                |
| \**       | ``.pow()``      |                 |                |

# Filtering

Filtering refers to the process of selecting specific rows or columns from a DataFrame based on certain conditions or criteria. It allows you to extract the data that meets a specific set of requirements, such as values that satisfy a particular condition or fall within a certain range, to focus on relevant information for analysis or further processing.

## Boolean indexing

TODO

E.g. ``df[df['column'] > 10]``

``.isin()``  
``.between()``

### Using .iloc and .loc

TODO

E.g. ``df.loc[df['column'] > 10, 'column']``

## Using ``.query()`` and ``.eval()`` methods (preferred!)

TODO

E.g. ``df.query('column > 10')``  
E.g. ``df.query('SiO2 > 50 and MgO > 5')``

# Reshape DataFrames: the ``pd.pivot_table()`` method

Let's imagine the case where we are really interested in comparing the major element composition of different types of rock. In this case the observations (rows) would be the rock type and the variables (columns) the percentage of oxides of the different elements. The ``.pivot_table()`` method allows us to reorganise a table according to our needs. In this case, we are going to tell it to take the different oxides as columns and reset the indices of our new DataFrame.

In [17]:
new_table = pd.pivot_table(dataset, columns=['Oxides'], sort=False).reset_index()
new_table

Oxides,index,SiO2,TiO2,Al2O3,Fe2O3t,MnO,MgO,CaO,Na2O,K2O,P2O5,LOI
0,primitive_mantle,44.91,0.16,4.44,8.05,0.13,37.81,3.54,0.36,0.03,0.02,NaN
1,mean_lower_crust,53.40,0.82,16.90,8.57,0.10,7.24,9.59,2.65,0.61,0.10,NaN
2,CO_eclogite,48.44,1.06,15.54,11.06,0.18,8.84,12.31,1.89,0.12,0.12,0.66
3,CO_granulite,48.41,1.19,16.95,13.93,0.25,5.44,10.43,1.66,0.62,0.44,0.62
4,CO_pyroxenite,50.94,0.11,3.24,6.12,0.14,21.84,14.87,0.33,0.05,0.01,1.59

In [18]:
# let's rename the column name used to reorganize
new_table = new_table.rename(columns={'index':'Oxides'})
new_table

Oxides,Oxides,SiO2,TiO2,Al2O3,Fe2O3t,MnO,MgO,CaO,Na2O,K2O,P2O5,LOI
0,primitive_mantle,44.91,0.16,4.44,8.05,0.13,37.81,3.54,0.36,0.03,0.02,NaN
1,mean_lower_crust,53.40,0.82,16.90,8.57,0.10,7.24,9.59,2.65,0.61,0.10,NaN
2,CO_eclogite,48.44,1.06,15.54,11.06,0.18,8.84,12.31,1.89,0.12,0.12,0.66
3,CO_granulite,48.41,1.19,16.95,13.93,0.25,5.44,10.43,1.66,0.62,0.44,0.62
4,CO_pyroxenite,50.94,0.11,3.24,6.12,0.14,21.84,14.87,0.33,0.05,0.01,1.59

In [19]:
# show the first row of the new DataFrame (should correspond to a column of the original DataFrame)
new_table.iloc[0, :]

Oxides
Oxides    primitive_mantle
SiO2                 44.91
TiO2                  0.16
Al2O3                 4.44
Fe2O3t                8.05
MnO                   0.13
MgO                  37.81
CaO                   3.54
Na2O                  0.36
K2O                   0.03
P2O5                  0.02
LOI                    NaN
Name: 0, dtype: object

This is a simple example of the ``.pivot_table()`` method, you can find more information with much more sophisticated examples (outside the scope of this course) in the following links:  
https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.pivot_table.html#pandas.DataFrame.pivot_table  
https://pandas.pydata.org/docs/user_guide/reshaping.html


# Using the ``.groupby()`` method

TODO

# Concatenating operations

TODO


# Using of Pandas' plotting capabilities

TODO

In [20]:
import sys
from datetime import date    
today = date.today().isoformat()

print(f'Notebook tested in {today} using:')
print('Python', sys.version)
print('Pandas', pd.__version__)

Notebook tested in 2023-05-24 using:
Python 3.10.11 | packaged by Anaconda, Inc. | (main, Apr 20 2023, 18:56:50) [MSC v.1916 64 bit (AMD64)]
Pandas 1.5.3